Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN God of High School.tmx
Source language: ko
Languages: en

source: 아까도 말했지만, 이게 최선이야.
en: like i said before, this is our best option.

source: 핏
en: fwip

source: 다함이 없는 무한한!!
en: inexhaustible and limitless...!!!

source: 쿠웅
en: thud

source: X세대 힘의 이양 시작
en: begin transferring power from generation x.

source: 웃기지마!
en: don’t make me laugh!

source: 콜록
en: cough

source: ...{j}아줌마..
en: {j}ms. heal...

source: 그것도 압승으로.
en: i swept the floor with him.

source: 생각하기 싫은 기억이 떠오르는군...
en: this is bringing up bad memories...

source: 버렸던 것들...
en: ...and throwing away...

source: 눈앞에 적들을 섬멸해줘.
en: wipe out all of the enemies in front of me.

source: 난 사탄.
en: i’m satan.

source: 파악
en: swoosh

source: 550화
en: episode 550

source: 않았어?!
en: see him?!

source: 드{j}드{j}드{j}드
en: {j}{j}{j}crack

source: Art&Story :
en: story/drawing:

source: 다 망가진 8문자 마지막 개방
en: completely broken 8th letter, final activation

source: 꿀꺽
en: gulp

source: 내가...{j}왜?
en: {j}why am i...?

source: 문열어!
en: open the doors!

source: 너희 아빤 세상에서 가장 나쁜놈...
en: your dad is the worst guy in the world...

source: 빠직
en: crackle

source: 키릭
en: twist

source: 성흔
en: stigmata

source: 주뗌므
en: je t'aime.

source: 넌!
en: you...

source: 콰{j}콰
en: krrk{j}

source: “업?”
en: karma?

source: 푸확
en: argh

source: 흥!
en: hmph!

source: 심장 내놔~
en: give me back my heart.

source: 살려줘!
en: help me!

source: 파이팅!
en: good luck!

source: 꺄~
en: kya

source: 재밌군...
en: interesting...

source: 마치 자신들의 구세주를 만난듯 그를 비호하기 시작했다.
en: ...like he was their savior.

source: 오빠.
en: mori.

source: 6부 RE:신과한판
en: chapter 6. re: a battle with the gods

source: 진짜이름을 되찾다
en: i will reclaim my true name.

source: 타악
en: hup

source: 큭!
en: urgh!

source: 신세계의 시간을 멈춰줘서 고맙군.
en: you have my gratitude for stopping the new world’s time.

source: 짧게나마 움직임이 제한된다.
en: their movements will be restricted, at least temporarily.

source: 찾아!!
en: find it!!!

source: 가!_x0003_
en: go!

source: 제 동생이에요...
en: this is my little sister...

source: 츳
en: SPARK

source: 오거
en: ...ogre?

source: 간다.
en: here i go.

source: 긱
en: swish

source: 오빠가 서 있었다.
en: ...was mori.

source: 으..
en: ugh...

source: 그정도면 충분해.
en: that’s plenty.

source: 파{j}앗
en: {j}whoosh

source: 허나...
en: but...

source: 이 잡신아!
en: you minor god!

source: 여래무기
en: tathagata’s weapons

source: 끝...
en: the end...

source: 파앗
en: kwoosh

source: 빙氷
en: ice.

source: 우둑
en: crack

source: 대앵
en: smack

source: 츠
en: whish

source: 우리가 없애는것보다, 증식 속도가 훨씬 빨라...
en: they're multiplying way faster than we can get rid of them...

source: 크으...
en: ugh...

source: 엄청난...{j}힘!
en: what incredible power...!

source: 6부
en: chapter 6

source: 쿵
en: boom

source: 크으으..!
en: grrr...!

source: 그렇구나...
en: i see...

source: 건투를 빈다!
en: good luck!

source: 너도 먹지 않았느냐?{j}삼장의 고기를?!{j}그그것도 산채로 씹어서!
en: did you not eat it, too? xuanzang’s flesh, that is?! you chewed her up alive!

source: 구구구
en: rumble

source: 제발...
en: please...

source: 어서..!
en: hurry...!

source: 박무진
en: ...mujin park.

source: 응?
en: huh?

source: 자신이 생겼어.
en: i’m sure now.

source: 억{j}뻐
en: thwap

source: 기이잉
en: whing

source: 어디 잡신 주제에 내 (신)인류를 건들지마.
en: don’t you dare mess with my (new) humanity, you minor god.

source: 우리가...{j}도와줄 수 있는 레벨이 아냐.
en: this is... past the level of something we could help with.{j}

source: 내게로 오라.
en: come to me.

source: 한번...{j}더?
en: again...?{j}

source: 드{j}드{j}드{j}드{j}드
en: urgh{j}{j}{j}{j}

source: 마치 바퀴벌레 같아.
en: you're like a bunch of cockroaches.

source: 계속해서 느껴지던, 위화감의 정체...
en: so the reason i kept feeling like something was off is...

source: 죽자살자 수련해라...
en: try training until it kills you...

source: 어떻게!
en: what do we do?!

source: 휙
en: fwip

source: 신神과 한판
en: battle with the gods

source: 아저씨 진짜야?
en: is it true, mister?

source: 박무봉과 하나된 여래...둘의 케미가 대단하군.
en: mubong and tathagata, in one body... their chemistry is incredible.

source: 여우....
en: fox...

source: 믿어 아찌...
en: I believe in you, mister...

source: 그정도까지 가능하다는 건가?{j}이쪽차원의 제천은?
en: you’re that strong, jaecheon of this world?{j}

source: 신세계 3중 시간정지 술식 완성
en: triple time stop of the new world complete.

source: 카이퍼벨트
en: ...lies the kuiper belt...

source: 차원이여 빨아들여라.
en: gates, suck them in.

source: 우리은하 외곽
en: the outer edges of the milky way

source: 힘을 빌려줘.
en: ...lend me your strength.

source: 으...
en: ugh...

source: 파직
en: spark

source: 기다려...그건...{j}네...딸...
en: wait... that’s... your daughter...

source: 成侃雷電
en: NEBULA THUNDERBOLT

source: 내...{j}딸아...
en: my daughter...

source: 모리공...
en: sir...

source: 살아 있었구나...
en: you were alive...

source: 몸으로 막아!
en: block it with your bodies!

source: 한가지 약속할 수 있는건...
en: but i can promise you one thing...

source: 틱
en: CRACK

source: 삼장?
en: xuanzang?

source: ㅎ
en: haha

source: 뿌득
en: grit

source: 콰드드득
en: whoosh

source: 헉!
en: huff

source: 재앙의 연속이야...
en: ...is it just one disaster after another?

source: 콰직
en: crunch

source: 원숭이 놈에게 받은 대미지가 생각보다 크다!
en: that monkey did more damage than i thought!

source: 그리고 용기...
en: and courage...

source: 맞아.
en: that’s right.

source: 주요행성 쉴드 완성!
en: shield around the main planet complete!

source: 까딱
en: flick

source: 터업
en: grab

source: 지금 그게...{j}네 아이에게 할 소리야?!
en: {j}how can you say that to your own baby?!

source: 기껏해야 토착신의 말같지 않은 예언...{j}그런 것 때문에 내던지기엔 여래의 목숨은 너무 숭고합니다
en: tathagata, your life is too noble to throw away on the nonsensical prophecy of the native god...{j}

source: 차력사
en: power usage

source: 뚜둑
en: drip

source: 뚜두둑
en: crack

source: 그러니 내옆에 꼭 붙어있어!
en: so stay with me!

source: 쳐라
en: strike.

source: 촤{j}악
en: {j}slash

source: 할아버지 이름이야!
en: it was my grandpa’s name!

source: 응.
en: okay.

source: 행성파괴용...{j}여섯번째 문자 여정 군체
en: this is the planet-destroying fairy colony of the 6th letter...{j}

source: 콰득
en: snap

source: 에비~!
en: bleh!

source: 방주대파
en: arks damaged.

source: 난...{j}신이 싫다.{j}그래서 너도 싫어.
en: I... hate the gods, so I hate you...{j}{j}

source: 동조한다?
en: ...are agreeing?

source: 가라!
en: now, go!

source: 奇跡
en: miracle

source: 으아아아아!!!
en: arghhh!!!

source: 여기
en: here.

source: 우연히 목격하게 된 경이驚異
en: a marvel he witnessed by coincidence.

source: 찾아라!
en: find it!

source: 우리 동네에선 한대위가 여래가 되지...
en: where I'm from, daewi han becomes tathagata.

source: 쿠콰콰
en: roar

source: 찰박
en: sploosh

source: 데려가지 않는다고...
en: i said i wouldn’t be taking you with me...

source: 정말...
en: ...sorry...

source: 나다.
en: me.

source: 옥황?
en: the jade emperor?

source: 잡아야지.
en: i am.

source: 버리고...
en: ...and throwing away...

source: 생각은 좋지.
en: talk is cheap.

source: 잘 됐어...
en: this is good...

source: ...의 외곽
en: at its edge...

source: 만물창조
en: the creation of all things

source: 180대 월영
en: 180th moon shadow

source: ...오라.
en: come to me...

source: 그간 자신이 받았던것들을...
en: would give back...

source: 직선상의 모든걸 섬멸 시켜버리는군!
en: it’s destroying everything in his line of sight!

source: 모두를 지켜?
en: you’ll protect everyone?

source: 어?
en: huh?

source: 너희는 그런 선택을 했구나...
en: so that’s what you decided on...

source: 무반동.
en: recoilless.

source: 촤
en: splash

source: 그 살점을 잘 보관해뒀다가 인간세상에 뿌리도록...
en: ...take my flesh and scatter it across the human world...

source: 사탄은 1천계 주인으로 등극 한다.
en: ...satan ascended to the position of master of the first heavenly realm.

source: 극
en: press

source: 단 몇초라도 좋으니!{j}버텨!!
en: it’s okay if it’s only for a few seconds! hold your ground!!!{j}

source: 크으으.....
en: ughhh...

source: 상...만숙...
en: mansuk...

source: 아무것도...{j}느껴지지 않는다...
en: i don’t sense anything...{j}

source: 인간에서 신의 위치에 올라설때도 그랬듯...
en: just as i was when i ascended to the position of a god...

source: 이자식!{j}신세계까지 다 먹어치울 생각이야!
en: that scum! he’s trying to eat the entire new world!

source: 설마...
en: no way...

source: 이름...
en: a name...

source: 큭!큭큭큭!!
en: hahahaha!!!

source: 시간을 끌기위해서....
en: in order to stall for time...

source: 인간 제일주의?!
en: human centrism?!

source: 해 마
en: hae ma

source: 투쾅
en: whabam

source: “힘이 없으면 모든게 무의미 하다”
en: “everything is meaningless if you’re weak.”

source: 인정 해야겠군...
en: I'll admit it...

source: 네!
en: yeah!

source: 먹는것도 내쪽이야
en: I’m the one who’s going to eat you,

source: 진심이야?
en: are you serious?

source: 억
en: crack

source: 오른다리가...{j}완전히 나갔어.
en: my right leg is completely unusable...{j}

source: 쿠콰광
en: rumble

source: 쫘아악
en: tear

source: 六문자
en: 6th letter

source: 너...{j}몸이...
en: you’re...{j}

source: 허억
en: huff

source: 저러면 대미지가...
en: if he keeps that up, he’ll take too much damage...

source: 부서져...
en: is going to be destroyed...

source: 난 너를 데려가지 않는다.
en: i’m not taking you with me.

source: 허나
en: however...

source: 쿨쩍
en: hic

source: 쿠쿵
en: boom

source: 어떻게?
en: am i...?

source: 尊命
en: higher life.

source: 저녀석과의 싸움에서...
en: i lost to that guy...

source: 퍼억
en: thwack

source: 견디지 못했구나.
en: it couldn’t take any more.

source: 넌 좀 ㅊ맞아야해.
en: you need a good beating,

source: 뿌드득
en: pop

source: 쌌어?!
en: she soiled her diaper?!

source: 이딴 신의 농간따위...{j}철저하게 망쳐주마.
en: i’ll thoroughly crush this little trick of the gods...{j}

source: 어?!
en: huh?!

source: 그래!
en: okay!

source: 그런걸 몇마리나 이쪽으로 데리고와?
en: and you bring how many of those things into this world?

source: 553화
en: episode 553

source: 완전히 먹혀버린거냐 박무봉?!
en: ...get eaten, mubong?!

source: 그래...{j}여기는 답답하구나.
en: truly... this place is stifling.{j}

source: 이쯤되면 인정하고 싶어지잖아?{j}박무보
en: you make me want to acknowledge you, mubong.{j}

source: 어서 일어나.
en: hurry and get up.

source: 난 신이 싫다고...
en: I hate gods...

source: 여래의 파편(UNKNOWN) 을 산산조각 냈을때...
en: when the fragment of tathagata was smashed to smithereens...

source: 오딘...
en: odin...

source: 푸슛
en: splurt

source: 두번 다시 그런 일을 겪지 않기 위해
en: ...i don’t have to go through something like that a second time...

source: 고마워...{j}날...{j}선택해줘서...
en: thank you for choosing me...{j}{j}

source: 많이 걱정 시켰지?
en: i made you worry a lot, didn’t i?

source: 오빠가 아파!!!
en: mori is hurt!!!

source: 힘을 잃었어.
en: i lost my power.

source: 스토리아키텍쳐:
en: story architect:

source: 퍽
en: splurt

source: 파칵
en: crack

source: 뭐...
en: well...

source: 아빠...
en: daddy...

source: 오빠!
en: mori!

source: 내,내 몸에서...
en: g-get out of...

source: 쓸데 없는 것들을 모조리 정리하고 갈 수 있어서.
en: i’ll be able to take out all of the trash before i go.

source: 잘가라.
en: goodbye.

source: 떠엉
en: whoom

source: 그것이 모여 기적을 일으킨다.
en: they’re combining to make a miracle.

source: 아따끄
en: attaque.

source: 보여줄게 남았느냐?
en: do you still have something left to show me?

source: 모두 충격에 대비해!!!
en: everyone prepare for impact!!!

source: 이렇게 많은 사람을 살려내다니 너 진짜 대단하구나?!
en: i can’t believe you brought all these people back to life. you’re amazing!

source: NOA에 탑승한 집행위원들이 모아준 에너지...
en: and this is the energy collected by the executives who boarded NOA...

source: 신일합일...
en: a true union between mankind and the gods...

source: 그리고 긴고아는 어떻게 된거지?
en: what happened to the loop of binding?

source: 이것들이...{j}진짜...
en: {j}you bastards...

source: 키득
en: snicker

source: 역겨워.
en: it’s revolting.

source: 바...ㄱ
en: mu...

source: 얼마쯤 올랐을까?
en: how high had he climbed when he saw it?

source: 아냐 조금달라!{j}그래도 먹어치워!
en: no, they are a little different! but eat them anyway!{j}

source: 긁적
en: scratch

source: 직경 19조km에 달하며 대부분 암석과 얼음으로 이루어진 천체 구름
en: ...a celestial cloud which measures 12 trillion miles wide and made of mostly rocks and ice.

source: 너라면...{j}깨우쳤을거라 생각했는데, 아직 멀었구나.
en: I thought you of all people would have realized the truth... but you still have a ways to go.{j}

source: ART/STORY 박용제
en: story/drawing by yongje park

source: 7층 6층 5층...
en: the seventh, the sixth, the fifth floor...

source: 힘이 먼저다.
en: power comes first.

source: 큭...!
en: urgh...!

source: 인간...
en: human?

source: 너희의 싹을 잘라버리는게 내 마지막 소임.
en: stamping you out is my final task.

source: 한성욱 어 시 스 트 :
en: seong-uk han assistant:

source: 오랜만이구나 오공아...
en: it has been a while, wukong...

source: 그게 네 이름이야.
en: that is your name.

source: 분명...{j}이건 새로운 신화의 시작
en: it was, without a doubt, the birth of a new myth...{j}

source: 우연의 일치겠지만...{j}진모리녀석 힘을 받을 때 육체적으로 ‘최약’이었어.
en: it’s probably a coincidence... but mori was physically at his weakest when he got this power.{j}

source: 발사
en: fire.

source: 이름...이라...
en: a name, huh...

source: 요정의 빛
en: and fairies’ light.

source: 박무봉
en: mubong.

source: 까득!
en: grit

source: 기적...
en: a miracle...

source: 이 힘을 써도, 이별을 부수지 않을 자신이...
en: i’m sure i can use this power without destroying this planet...

source: 이건...?
en: this is...

source: 굉장해...
en: amazing...

source: 갓 오브 하이스쿨
en: the god of highschool

source: 성간뇌전
en: NEBULA THUNDERBOLT

source: 힘.
en: power.

source: 허억!{j}헉!
en: huff

source: 스치는 모든것과 융합하고 있어!
en: he’s fusing together with everything he touches!

source: 우린 아직 포기하지 않았어요.
en: we haven’t given up yet.

source: 내 힘을 가져가.
en: take my power.

source: 내가...
en: how...

source: 천체 성운 활성화 완료!
en: nebula fully energized!

source: 끝까지 쓰레기구나!
en: ...can’t help being a piece of trash!

source: 움직임을 제한 할 수 있어.
en: we can restrict their movements.

source: 우리쪽에선 유미라가 여래...
en: mira yoo is my tathagata...

source: 즈응
en: flicker

source: 해치를 열어!!
en: open the hatch!!!

source: 쏟아부어!
en: full power!

source: 우리 고객들 기스(상처)나지 않게 신경들 써.
en: don’t let our customers get scratched up (injured).

source: 꺾고 뺏어도...
en: no matter what i break or take away...

source: 또?!
en: again?!

source: 더.
en: more.

source: 뜨와...
en: what...

source: 응!
en: okay!

source: 방금 공격은...{j}나도 위험했어.
en: I admit it was touch-and-go after that last attack...{j}

source: 파삭
en: whoosh

source: 아줌마!
en: ms. heal!

source: 후
en: swoosh

source: 하여튼...
en: jeez...

source: 들어오거라!
en: come at me!

source: 대단하군.
en: how impressive.

source: 아저씨가 구해줄게!
en: i’ll save you!

source: 벨제버브...
en: beelzebub...

source: 원심력으로 요정의 빛을 막는다?
en: you’re using centrifugal force to block the fairies’ light?

source: 이세계에선 여기까지가 한계!
en: this is as far as we go in this world!

source: 정신적인 부분까지 쎈것
en: ...includes being mentally strong.

source: 되돌려 준다.
en: everything she had received until now.

source: 네가 박무봉 아이구나?
en: so you’re mubong’s kid?

source: 다리가 아파요.
en: she hurt her leg.

source: 젠장!
en: dammit!

source: 실컷 처 맞아야해!
en: ...need a good beating!

source: 글쎄?
en: who knows?

source: 진
en: jin.

source: 촤{j}아
en: whoosh

source: 화륵
en: blaze

source: 팡
en: jump

source: 에비~
en: bleh

source: 살상력에 치우친 나머지 컨트롤이 안되거든....
en: you see, they were only good for killing and couldn’t be controlled...

source: 딘 덕에 미리 정비 할 수 있어서 다행임.
en: it’s a good thing we were able to finish repairing it beforehand, thanks to dean.

source: 다들 집중해!
en: focus, everyone!

source: 일점돌파 &
en: now go. single-point break...

source: 안보였..
en: I didn’t see...

source: 찰방
en: splish

source: 성운뇌전
en: NEBULA THUNDERBOLT

source: 발
en: i’m gonna...

source: 어딜가?!{j}모!
en: where do you think you’re going?!

source: 전부 네가 쌓은 업.{j}그 업보를 받는구나.
en: this is all karma. you reap what you sow.

source: 크....!
en: ugh...!

source: 내가 밟았다.{j}완전히...
en: i completely crushed the guy...{j}

source: 네가 맡아줘.
en: take care of it for me.

source: 사탄의 날개를 에너지로 전환시키고 있어.
en: he’s turning satan’s wings into energy.

source: 이 아이를 부탁해.
en: we’re leaving this baby in your hands.

source: 키이잉
en: whing

source: 마치...
en: and...

source: 그래서..{j}힘을 잃었어.
en: that’s how i lost my power...{j}

source: 뻐억
en: thwack

source: 네가 전체힘을 다 쓰지않는 것도 두려워서지?
en: the reason you’re not using your full power is because you’re afraid, isn’t it?

source: 이쪽 제천은 흥미로워!
en: this world is interesting!

source: 아부!
en: agoo!

source: 살아.
en: live.

source: 더...
en: more...

source: 일렁
en: quiver

source: 콰{j}!!!{j}드{j}드{j}득
en: {j}!!!{j}{j}{j}slash

source: 응...{j}그럴지도...
en: yeah... maybe so...{j}

source: 멈...췄다?!
en: they... stopped?!

source: 츄릇
en: slurp

source: 선체 40% 대파!
en: 40% of the hull is out of commission!

source: 아부~
en: ugoo!

source: 무슨...
en: what?

source: 드
en: crack

source: 빛이 있으라...
en: let there be light...

source: 진짜 아저씨가 저 사람을 이겼다고?!
en: you really defeated that person?!

source: 드{j}드{j}드
en: shudder{j}{j}

source: 스{j}윽
en: {j}whish

source: 콜록!
en: cough

source: 네 자리에 잠시 있어보니 얼마나 힘든 자리인지 알게됐음
en: i’ve only stood in your shoes for a short time, but i finally understand how hard you had it.

source: 내일부로 난 영면에 들 것이야
en: starting tomorrow, i will enter the eternal slumber.

source: 터덥
en: thud

source: 꺼져!
en: ...my body!

source: 째깍
en: TICK TOCK

source: 미친..!{j}이게 대화냐?!{j}남의 얘긴 콧등으로도 안듣는 놈이?!
en: what the hell?! you call this a conversation?! it’s like talking to a wall!{j}{j}

source: 좋다.
en: fine.

source: 요정이 실패작인 이유는...
en: the fairies were a failure...

source: 킷
en: GURGLE

source: 거부술식 전개
en: rejection technique activate

source: 쳐라.
en: strike him.

source: 충분해.{j}그정도면
en: that’s plenty.{j}

source: 계단에 닿는 즉시...
en: as soon as they touch the stairs...

source: 아니 저건!
en: no, those are...!

source: 108양차 나기동
en: the beast gidong nah!!!

source: 전부 줄게...
en: everyone’s energy...

source: 이...힘을 컨트롤 하기엔...
en: this is too much power...

source: 부디 건강하길...
en: i wish you well...

source: 7...7문...
en: 7th... letter...

source: 여래만큼은 하나같이 증오하는것.
en: all of them hate tathagata.

source: 들리나요?
en: can you hear us?

source: 부들
en: shake

source: 기적이...{j}일어났어...
en: {j}a miracle happened...

source: 있을때...
en: central realm...

source: 아부...
en: ugoo!

source: 설레임, 부드러움, 따뜻함...
en: excitement, tenderness, warmth...

source: 하지만 내생각은 다르다.
en: but i disagree.

source: 차거
en: that’s cold.

source: 네 선택을 존중한다...
en: i respect your decision...

source: 기다려.
en: wait for me.

source: 큭!!
en: urgh!

source: 끊임없이 달려든다.
en: he won’t stop charging back.

source: 나...
en: so that...

source: 화{j}악
en: flash{j}

source: 널 꺾기 위해..{j}내 기억에서 지웠던 힘을 되찾는다...!
en: {j}i’ll reclaim the power i’d forgotten how to use to take you down...!

source: 그날부터 그의 목표는 명확해졌다
en: from that day on, he had a clear goal.

source: 1천계의 주인...
en: i, satan, will be...

source: 소실 확인!
en: disappearance of the shield is confirmed!

source: 촤악
en: thunk

source: 조금이지만 힘은 남아있어.
en: it’s only a little, but we still have some power left.

source: 언제까지 낯가리고 있을거야?
en: how long are you gonna stay in hiding...

source: 당신의 미래는 읽을 수 없지만, 우리의 미래는 봤어.
en: I might not be able to see your future, but I saw ours.

source: 그리고!!!
en: and...

source: 그렇기에 이해받을 생각따윈 없다.
en: so, i don’t need anyone’s understanding.

source: 이쪽은 제법..
en: this place is pretty...

source: 터{j}업
en: {j}grab

source: 놀자.
en: let’s play.

source: 전에 묻었던...{j}여래의 육편이...{j}침식 한다?!
en: the fragment of tathagata that was buried in his body... is eating away at him?!{j}{j}

source: 이런 미친...
en: this is ridiculous...

source: 분신?
en: clones?

source: 정면돌파...?
en: a frontal assault...?

source: 츠츳
en: chhh

source: 아브지...마..
en: feew... bettuh...

source: 네 목숨만큼은 무슨일이 있어도 지킬게.
en: no matter what happens, i’ll protect you.

source: 나도...
en: me too...

source: 호오~
en: oooh!

source: 그(녀)는 그곳의 정점에 올라서 있었다.
en: ...he was already standing at the top.

source: 잉{j}키
en: {j}whing

source: 최약체에서 저정도로 레벨업했다면, 단모리에서 진모리로 변하면 어떻게 될까?
en: if he’s leveled up that much at his weakest, what do you think’ll happen if mori dan becomes mori jin?

source: 그리고 꼭 돌아와야해!!
en: you have to come back too!!!

source: 오빠...
en: mori...

source: 준비
en: ready.

source: 되려 더 강해져서 물어뜯는다.
en: in fact, he gets stronger each time.

source: 그런게 가능하다고?
en: that's possible?

source: 아들 세상은 책속에만 있는게 아니란다~
en: SON, THE WORLD IS NOT IN BOOKS OR MAPS. YOU MUST GO OUT TO LEARN THE REAL WORLD!

source: 박태진...
en: taejin park...

source: 七문자
en: 7th letter

source: 뭐 됐고, 이제 지리한 이 싸움을 끝내자.
en: yeah, yeah. now, let’s end this fight...

source: 먹힌건 어느쪽?
en: but who actually swallowed who?

source: 안보였...
en: I didn’t see...

source: 천수
en: thousand hands

source: 멈춘건가?
en: time stop?

source: 허나 그걸로 뭘 할 수 있다는거냐?
en: but what can you actually do?

source: 네가...{j}예언의 절대신 이라는 건가?
en: you’re... the supreme god from the prophecy?{j}

source: 췩
en: swish

source: 아직 어린 널 이렇게나 위험한 상황에 휘말리게 해서...
en: we got you mixed up in something so dangerous when you’re just a baby...

source: 마지막 한발!
en: fire the last round!

source: 근두운
en: geundoowun.

source: 내가 줄 수 있는 유일한 선물.
en: this is the only gift i can give you.

source: 당신에겐 꼭 고맙다는 인사 전하고 싶었어!_x0003_
en: I really wanted to thank you!

source: 저기...
en: over there...

source: 태양계
en: our solar system.

source: 분신술은 아니고...
en: they aren’t clones...

source: 여의
en: yeoui.

source: 뭔진...{j}모르겠지만...{j}숨이 턱턱막혀!
en: i’m not sure what’s going on... but it’s hard to breathe!{j}{j}

source: 컵 쟌
en: cup jan

source: 그 애는...네 딸이야!
en: that kid is... your daughter!

source: 크아아아아
en: arghhh!!!

source: 라그나로크...
en: during ragnarok...

source: 2배?{j}3배?
en: twice, no, thrice as many?{j}

source: 여래의 일곱번째 문자
en: tathagata’s 7th letter

source: 부탁해...
en: i’m leaving the rest up to you...

source: 너 만큼은 목숨걸고 지킬게.
en: i’ll protect you with my life.

source: 지축
en: jichuk

source: 그렇게 해야할 거 같은 ‘감’이 왔어
en: i have a feeling that we have to do it this way.

source: 그거알아?
en: you know something?

source: 쓸데없는건...{j}없어.
en: {j}nothing’s... useless.

source: 저리 꺼져!
en: piss off!

source: 창세기.
en: genesis.

source: 여의가...
en: the yeoui...

source: 미안...
en: sorry...

source: 부비
en: ruffle

source: 일명 천계의 쓰레기통....
en: ...otherwise known as the heavenly realm’s dumpster...

source: 예언은 아직 진행중이다.
en: the prophecy is still ongoing.

source: 광자화 됐어...{j}저걸 어떻게...?!
en: ...is radiating light. how?!{j}

source: 괘,괜찮아?!
en: a-are you okay?!

source: 훌쩍
en: hic

source: 헉
en: huff

source: 어딜가?{j}무봉아...{j}아니, 여래라고 해야하나?
en: where are you off to, mubong? or should I call you tathagata?

source: 누가 내 뒷담화를?!
en: WHO'S TALKING ABOUT ME BEHIND MY BACK?!

source: 제 6문자...{j}최악의 무기.
en: the 6th letter is the worst.{j}

source: 지금껏 내가 걸어온 길.
en: this is the path i’ve followed.

source: 방금...
en: just now...

source: 파
en: shwap

source: 더 쎄게...
en: more power...

source: 후웁!
en: ugh!

source: 모두 피해!
en: everyone, run!

source: 이별을 부수지 않고, 이 힘을 쓸 자신이...
en: i’m sure i can use this power without destroying this planet...

source: 막 쳐라.
en: strike everything.

source: 오!
en: oh!

source: 정신차려!
en: wake up!

source: 인류99.99%전멸
en: 99.99% of humanity annihilated.

source: 쩌
en: crack

source: 지직
en: crackle

source: 가슈!{j}형님
en: go, brother!{j}

source: 그래서..
en: that’s how...

source: (진모리)
en: mori...?

source: 순간이나마 네 기를 느낀적 있었어...
en: ...i sensed your power for a moment.

source: 쿨럭
en: cough

source: 자신의 핏줄에 대한...
en: about your blood...

source: 항상 겁이 났다.
en: i was always afraid.

source: 슈{j}슉
en: {j}shwoop

source: 모두...{j}내게서...{j}떨어져...!
en: all of you... get away... from me...!

source: 기적발현
en: manifest miracle

source: 우린 주변 사람들을 대피시키자.
en: let’s evacuate the people nearest to us first.

source: 그딴거 애초에 관심없고, 그냥 너만 실컷 패면 돼.
en: i never cared about that stuff. all i want is to beat you into the ground.

source: 내인생 최초로
en: it was the first time i encountered...

source: 기회는 단한번
en: we have one chance.

source: 피잇
en: swish

source: 내눈에 조차...{j}흐릿하게 보일까 말까 인데...
en: even i... can only barely make them out...

source: 나 역시 낙원에서 추방 받았던 몸
en: i, too, was banished from paradise.

source: 쭈뼛
en: thump

source: 아브비바...
en: feew bettuh...

source: NOA는 무너졌다 방주는 깨졌고 한대위 유미라에 이어
en: noa has fallen and the arks are destroyed. daewi han and mira yoo lost...

source: 우쭈쭈~
en: look at me!

source: 잇{j}피
en: zoom

source: 내가 가지.
en: leave it to me.

source: 허나 그걸로 뭘 할 수 있다는거지?
en: but what can you actually do?

source: 아;
en: ah!

source: 시간이여...
en: hear me, time...

source: 친구...들...을..
en: ...friends... to... you...

source: 어서..!{j}그 주술을 나에게!!
en: hurry! cast that spell on me!!!{j}

source: 정적
en: halt

source: 치잇!
en: urgh!

source: 으으...
en: ugh...

source: 도와줘야 하는 거 아냐?
en: shouldn’t you be helping him?

source: 전력 전개
en: full power.

source: SASEOHARM 어 시 스 트 :
en: saseoharm assistant:

source: 가즈아!
en: let's gooo!
